УчетВУправляющихДляГит1/src/DataProcessors/ПроверкаРегистрацииСчетовФактурНаАванс/ПроверкаРегистрацииСчетовФактурНаАванс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПроверкаРегистрацииСчетовФактурНаАванс</name>
</mdclass:DataProcessor>

УчетВУправляющихДляГит1/src/AccumulationRegisters/НДСЗаписиКнигиПродаж/НДСЗаписиКнигиПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НДСЗаписиКнигиПродаж</name>
  <comment>НДС. Записи книги продаж</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерДокументаОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВидаОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетФактура</name>
    <type>
      <types>DocumentRef.СписаниеСРасчетногоСчета</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ГТДИмпорт</types>
      <types>DocumentRef.КорректировкаПоступления</types>
      <types>DocumentRef.ВыкупПредметовЛизинга</types>
      <types>DocumentRef.СчетФактураВыданный</types>
      <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.НачислениеПеней</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ОказаниеУслуг</types>
      <types>DocumentRef.МодернизацияОС</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ПередачаТоваров</types>
      <types>DocumentRef.ОплатаПлатежнойКартой</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.СчетФактураПолученный</types>
      <types>DocumentRef.ПередачаНМА</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
      <types>DocumentRef.ВосстановлениеНДС</types>
      <types>DocumentRef.ЗаявлениеОВвозеТоваров</types>
      <types>DocumentRef.РеализацияУслугПоПереработке</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ОтражениеНачисленияНДС</types>
      <types>DocumentRef.ОтражениеНДСКВычету</types>
      <types>DocumentRef.РеализацияОтгруженныхТоваров</types>
      <types>DocumentRef.НачислениеНДСпоСМРхозспособом</types>
      <types>DocumentRef.ПоступлениеДопРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦенности</name>
    <type>
      <types>EnumRef.ВидыЦенностей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОплаты</name>
    <type>
      <types>DocumentRef.СписаниеСРасчетногоСчета</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ГТДИмпорт</types>
      <types>DocumentRef.ВыкупПредметовЛизинга</types>
      <types>DocumentRef.СчетФактураВыданный</types>
      <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ОперацияБух</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ПоступлениеНМА</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ОплатаПлатежнойКартой</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.ПередачаНМА</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.РеализацияУслугПоПереработке</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ОтражениеНачисленияНДС</types>
      <types>DocumentRef.ПоступлениеДопРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>EnumRef.СобытияПоНДСПродажи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаписьДополнительногоЛиста</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КорректируемыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СторнирующаяЗаписьДопЛиста</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <comment>Договор контрагента (для СФ на аванс, нал.агента по 161.5)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсправленныйСчетФактура</name>
    <type>
      <types>DocumentRef.КорректировкаПоступления</types>
      <types>DocumentRef.СчетФактураВыданный</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.СчетФактураПолученный</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УчетВУправляющихДляГит1/src/Enums/ВидыЦенностей/ВидыЦенностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЦенностей</name>
  <enumValues>
    <name>АвансыВыданные</name>
  </enumValues>
  <enumValues>
    <name>АвансыПолученные</name>
  </enumValues>
  <enumValues>
    <name>АвансыПолученные0</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееПотребление</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>ВозвратАвансовПолученных</name>
  </enumValues>
  <enumValues>
    <name>ИмуществоСУчетомНДС</name>
  </enumValues>
  <enumValues>
    <name>КомандировочныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>Материалы</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентАренда</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентРеализацияИмущества</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентИностранцы</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентЭлектронныеУслуги</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентКомитент</name>
  </enumValues>
  <enumValues>
    <name>НМА</name>
  </enumValues>
  <enumValues>
    <name>Оборудование</name>
  </enumValues>
  <enumValues>
    <name>ОбъектыНезавершенногоСтроительства</name>
  </enumValues>
  <enumValues>
    <name>ОС</name>
  </enumValues>
  <enumValues>
    <name>ПосредническиеУслуги</name>
  </enumValues>
  <enumValues>
    <name>ПредставительскиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРаботыИУслуги</name>
  </enumValues>
  <enumValues>
    <name>СМРПодрядные</name>
  </enumValues>
  <enumValues>
    <name>СМРСобственнымиСилами</name>
  </enumValues>
  <enumValues>
    <name>СуммыСвязанныеСРасчетамиПоОплате</name>
  </enumValues>
  <enumValues>
    <name>ТаможенныеПлатежи</name>
  </enumValues>
  <enumValues>
    <name>ТаможенныеПлатежиОС</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ТоварыУслугиКомитентов</name>
  </enumValues>
  <enumValues>
    <name>ТаможенныйСоюз</name>
  </enumValues>
  <enumValues>
    <name>ТоварыНесырьевые</name>
  </enumValues>
  <enumValues>
    <name>ТоварыНалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>АвансыВыданныеНалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>АвансыПолученныеНалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>ВозвратАвансовПолученныхНалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеУслуги</name>
  </enumValues>
  <enumValues>
    <name>УслугиНеНаТерриторииРФ</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/DataProcessors/ПроверкаРегистрацииСчетовФактурНаАванс/ManagerModule.bsl
Функция ПроверитьРегистрациюСчетовФактурНаАванс(Интерактивно = Ложь) Экспорт
	
	Если ТекущаяДатаСеанса() >= '20190426' Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Проверяем по доступу
	Если НЕ ПравоДоступа("Просмотр", Метаданные.Обработки.ПроверкаРегистрацииСчетовФактурНаАванс) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Проверяем только в главном узле
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Проверяем только если есть прво просмотра документа "Счет-фактура выданный"
	Если НЕ ПравоДоступа("Просмотр", Метаданные.Документы.СчетФактураВыданный) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ Интерактивно Тогда
		НеПроверятьПриНачалеРаботы = ХранилищеОбщихНастроек.Загрузить("ПроверкаРегистрацииСчетовФактурНаАванс", "НеПроверятьПриНачалеРаботы");
		Если НеПроверятьПриНачалеРаботы = Истина Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// Проверяем только если есть плательщики НДС
	Если НЕ ПолучитьФункциональнуюОпцию("ПлательщикНДС") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Проверяем только если есть хоть один счет-фактура
	Если НЕ ЕстьСчетФактура() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

Функция ЕстьСчетФактура()
	
	МассивОрганизаций = ОбщегоНазначенияБПВызовСервераПовтИсп.ВсеОрганизацииДанныеКоторыхДоступныПоRLS(Ложь);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачПериода", '20181001000000');
	Запрос.УстановитьПараметр("КонПериода", '20181001235959');
	Запрос.УстановитьПараметр("МассивОрганизаций",МассивОрганизаций);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НДСЗаписиКнигиПродаж.Регистратор КАК Документ
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО НДСЗаписиКнигиПродаж.Регистратор = СчетФактураВыданный.Ссылка
	|ГДЕ
	|	НДСЗаписиКнигиПродаж.Период МЕЖДУ &НачПериода И &КонПериода
	|	И НДСЗаписиКнигиПродаж.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыПолученные)
	|	И НДСЗаписиКнигиПродаж.Организация В(&МассивОрганизаций)
	|	И НДСЗаписиКнигиПродаж.ЗаписьДополнительногоЛиста
	|	И НДСЗаписиКнигиПродаж.КорректируемыйПериод < &НачПериода
	|	И НЕ СчетФактураВыданный.Выставлен
	|	И НЕ СчетФактураВыданный.РучнаяКорректировка";
	
	УстановитьПривилегированныйРежим(Истина);
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции
